apache/mynewt-core/hw/mcu/stm/stm32_common/src/hal_spi.c
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#include <string.h>
#include <assert.h>
#include "os/mynewt.h"
#include <hal/hal_spi.h>
#include <hal/hal_gpio.h>
#include "mcu/stm32_hal.h"
#include "mcu/cmsis_nvic.h"

#define SPI_0_ENABLED (MYNEWT_VAL(SPI_0_MASTER) || MYNEWT_VAL(SPI_0_SLAVE))
#define SPI_1_ENABLED (MYNEWT_VAL(SPI_1_MASTER) || MYNEWT_VAL(SPI_1_SLAVE))
#define SPI_2_ENABLED (MYNEWT_VAL(SPI_2_MASTER) || MYNEWT_VAL(SPI_2_SLAVE))
#define SPI_3_ENABLED (MYNEWT_VAL(SPI_3_MASTER) || MYNEWT_VAL(SPI_3_SLAVE))
#define SPI_4_ENABLED (MYNEWT_VAL(SPI_4_MASTER) || MYNEWT_VAL(SPI_4_SLAVE))
#define SPI_5_ENABLED (MYNEWT_VAL(SPI_5_MASTER) || MYNEWT_VAL(SPI_5_SLAVE))

#define SPI_ENABLED (SPI_0_ENABLED || SPI_1_ENABLED || SPI_2_ENABLED || \
                     SPI_3_ENABLED || SPI_4_ENABLED || SPI_5_ENABLED)

#define STM32_HAL_SPI_TIMEOUT (1000)

#define STM32_HAL_SPI_MAX (6)

#if defined(STM32F1) && !defined(HAL_SPI_ERROR_FRE)
/*
 * For some reason HAL_SPI_ERROR_FRE is not defined for STM32F1.
 * It seems that it used to be. Definition is taken from STM32F0 since
 * register bit accessed the same as in very other STM32 MCU.
 */
#define HAL_SPI_ERROR_FRE               (0x00000008U)   /*!< FRE error                              */
#endif

extern HAL_StatusTypeDef HAL_SPI_QueueTransmit(SPI_HandleTypeDef *hspi,
        uint8_t *pData, uint16_t Size);

extern HAL_StatusTypeDef HAL_SPI_Slave_Queue_TransmitReceive(
        SPI_HandleTypeDef *hspi, uint8_t *pTxData, uint8_t *pRxData,
        uint16_t Size);

extern HAL_StatusTypeDef HAL_SPI_Transmit_IT_Custom(SPI_HandleTypeDef *hspi,
        uint8_t *pData, uint16_t Size);

extern HAL_StatusTypeDef HAL_SPI_TransmitReceive_IT_Custom(
        SPI_HandleTypeDef *hspi, uint8_t *pTxData, uint8_t *pRxData,
        uint16_t Size);

struct stm32_hal_spi {
    SPI_HandleTypeDef handle;
    uint8_t slave:1;                  /* slave or master? */
    uint8_t tx_in_prog:1;             /* slave: tx'ing user data not def */
    uint8_t selected:1;               /* slave: if we see SS */
    uint8_t def_char[4];              /* slave: default data to tx */
    struct stm32_hal_spi_cfg cfg;
    hal_spi_txrx_cb txrx_cb_func;     /* callback function */
    void            *txrx_cb_arg;     /* callback arguments */
};

static struct stm32_spi_stat {
    uint32_t irq;
    uint32_t ss_irq;
    uint32_t tx;
    uint32_t eovf;
    uint32_t emodf;
    uint32_t efre;
} spi_stat;

#if SPI_ENABLED
static void spi_irq_handler(struct stm32_hal_spi *spi);
#endif

#if SPI_0_ENABLED
struct stm32_hal_spi stm32_hal_spi0;
#endif
#if SPI_1_ENABLED
struct stm32_hal_spi stm32_hal_spi1;
#endif
#if SPI_2_ENABLED
struct stm32_hal_spi stm32_hal_spi2;
#endif
#if SPI_3_ENABLED
struct stm32_hal_spi stm32_hal_spi3;
#endif
#if SPI_4_ENABLED
struct stm32_hal_spi stm32_hal_spi4;
#endif
#if SPI_5_ENABLED
struct stm32_hal_spi stm32_hal_spi5;
#endif

static struct stm32_hal_spi *stm32_hal_spis[STM32_HAL_SPI_MAX] = {
#if SPI_0_ENABLED
    &stm32_hal_spi0,
#else
    NULL,
#endif
#if SPI_1_ENABLED
    &stm32_hal_spi1,
#else
    NULL,
#endif
#if SPI_2_ENABLED
    &stm32_hal_spi2,
#else
    NULL,
#endif
#if SPI_3_ENABLED
    &stm32_hal_spi3,
#else
    NULL,
#endif
#if SPI_4_ENABLED
    &stm32_hal_spi4,
#else
    NULL,
#endif
#if SPI_5_ENABLED
    &stm32_hal_spi5,
#else
    NULL,
#endif
};

#define STM32_HAL_SPI_RESOLVE(__n, __v)                          \
    if ((__n) >= STM32_HAL_SPI_MAX) {                            \
        rc = -1;                                                 \
        goto err;                                                \
    }                                                            \
    (__v) = (struct stm32_hal_spi *) stm32_hal_spis[(__n)];      \
    if ((__v) == NULL) {                                         \
        rc = -1;                                                 \
        goto err;                                                \
    }

static IRQn_Type
stm32_resolve_spi_irq(SPI_HandleTypeDef *hspi)
{
    uintptr_t spi = (uintptr_t)hspi->Instance;

    switch (spi) {
#if SPI_0_ENABLED
    case (uintptr_t)SPI1:
        return SPI1_IRQn;
#endif
#if SPI_1_ENABLED
    case (uintptr_t)SPI2:
        return SPI2_IRQn;
#endif
#if SPI_2_ENABLED
    case (uintptr_t)SPI3:
        return SPI3_IRQn;
#endif
#if SPI_3_ENABLED
    case (uintptr_t)SPI4:
        return SPI4_IRQn;
#endif
#if SPI_4_ENABLED
    case (uintptr_t)SPI5:
        return SPI5_IRQn;
#endif
#if SPI_5_ENABLED
    case (uintptr_t)SPI6:
        return SPI6_IRQn;
#endif
    default:
        assert(0);
    }
}

/*
 * SPI master IRQ handler.
 */
#if SPI_ENABLED
static void
spim_irq_handler(struct stm32_hal_spi *spi)
{
    if (spi->handle.TxXferCount == 0 && spi->handle.RxXferCount == 0) {
        if (spi->txrx_cb_func) {
            spi->txrx_cb_func(spi->txrx_cb_arg, spi->handle.TxXferSize);
        }
    }
}
#endif

/*
 * SPI slave IRQ handler.
 */
#if SPI_ENABLED
static void
spis_irq_handler(struct stm32_hal_spi *spi)
{
    if (spi->tx_in_prog) {
        if (spi->handle.TxXferCount == 0 && spi->handle.RxXferCount == 0) {
            /*
             * If finished with data tx, start transmitting default char
             */
            spi->tx_in_prog = 0;

