apache/mynewt-core/hw/mcu/stm/stm32_common/src/hal_spi.c
            HAL_SPI_Transmit_IT_Custom(&spi->handle, spi->def_char, 2);

            if (spi->txrx_cb_func) {
                spi->txrx_cb_func(spi->txrx_cb_arg, spi->handle.TxXferSize);
            }
        }
    } else {
        /*
         * Reset TX pointer within default data.
         */
        spi->handle.pTxBuffPtr = spi->def_char;
        spi->handle.TxXferCount = 2;
    }
}
#endif

/*
 * Common IRQ handler for both master and slave.
 */
#if SPI_ENABLED
static void
spi_irq_handler(struct stm32_hal_spi *spi)
{
    uint32_t err;

    spi_stat.irq++;

    HAL_SPI_IRQHandler(&spi->handle);
    err = spi->handle.ErrorCode;
    if (err) {
        if (err & HAL_SPI_ERROR_OVR) {
            spi_stat.eovf++;
        }
        if (err & HAL_SPI_ERROR_MODF) {
            spi_stat.emodf++;
        }
        if (err & HAL_SPI_ERROR_FRE) {
            spi_stat.efre++;
        }
        spi->handle.ErrorCode = 0;
    }
    if (!spi->slave) {
        spim_irq_handler(spi);
    } else {
        spis_irq_handler(spi);
    }
}
#endif

#if !defined(SPI_IT_TXE) && defined(SPI_IT_TXP)
#define SPI_IT_TXE                      SPI_IT_TXP
#endif
#if !defined(SPI_IT_RXNE) && defined(SPI_IT_RXP)
#define SPI_IT_RXNE                     SPI_IT_RXP
#define SPI_SR_RXNE                     SPI_SR_RXP
#endif

/*
 * GPIO interrupt when slave gets selected/deselected.
 */
static void
spi_ss_isr(void *arg)
{
    struct stm32_hal_spi *spi = (struct stm32_hal_spi *)arg;
    int ss;
    int len;
    uint16_t reg;

    spi_stat.ss_irq++;
    ss = hal_gpio_read(spi->cfg.ss_pin);
    if (ss == 0 && !spi->selected) {
        /*
         * We're now seeing chip select. Enable SPI, SPI interrupts.
         */
        if (spi->tx_in_prog) {
            __HAL_SPI_ENABLE_IT(&spi->handle,
              SPI_IT_RXNE | SPI_IT_TXE | SPI_IT_ERR);
        } else {
            __HAL_SPI_ENABLE_IT(&spi->handle, SPI_IT_TXE | SPI_IT_ERR);
        }
        reg = spi->handle.Instance->CR1;
        reg &= ~SPI_CR1_SSI;
        reg |= SPI_CR1_SPE;
        spi->handle.Instance->CR1 = reg;
        spi->selected = 1;
    }
    if (ss == 1 && spi->selected) {
        /*
         * Chip select done. Check whether there's pending data to RX.
         */
#if MYNEWT_VAL(MCU_STM32H7)
        if (spi->handle.Instance->SR & SPI_SR_RXP && spi->handle.RxISR) {
            spi->handle.RxISR(&spi->handle);
        }
#else
        if (spi->handle.Instance->SR & SPI_SR_RXNE && spi->handle.RxISR) {
            spi->handle.RxISR(&spi->handle);
        }
#endif
        /*
         * Disable SPI.
         */
        reg = spi->handle.Instance->CR1;
        reg &= ~SPI_CR1_SPE;
        reg |= SPI_CR1_SSI;
        spi->handle.Instance->CR1 = reg;

        __HAL_SPI_DISABLE_IT(&spi->handle, SPI_IT_RXNE|SPI_IT_TXE|SPI_IT_ERR);

        len = spi->handle.RxXferSize - spi->handle.RxXferCount;
        if (len) {
            /*
             * If some data was clocked out, reset to start sending
             * default data and call callback, if user was waiting for
             * data.
             */

            spi->handle.State = HAL_SPI_STATE_READY;

            HAL_SPI_QueueTransmit(&spi->handle, spi->def_char, 2);

            if (spi->tx_in_prog) {
                spi->tx_in_prog = 0;

                if (spi->txrx_cb_func) {
                    spi->txrx_cb_func(spi->txrx_cb_arg, len);
                }
            }
        }
        spi->selected = 0;
    }
}

#if SPI_0_ENABLED
static void
spi1_irq_handler(void)
{
    spi_irq_handler(stm32_hal_spis[0]);
}
#endif

#if SPI_1_ENABLED
static void
spi2_irq_handler(void)
{
    spi_irq_handler(stm32_hal_spis[1]);
}
#endif

#if SPI_2_ENABLED
static void
spi3_irq_handler(void)
{
    spi_irq_handler(stm32_hal_spis[2]);
}
#endif

#if SPI_3_ENABLED
static void
spi4_irq_handler(void)
{
    spi_irq_handler(stm32_hal_spis[3]);
}
#endif

#if SPI_4_ENABLED
static void
spi5_irq_handler(void)
{
    spi_irq_handler(stm32_hal_spis[4]);
}
#endif


#if SPI_5_ENABLED
static void
spi6_irq_handler(void)
{
    spi_irq_handler(stm32_hal_spis[5]);
}
#endif

uint32_t
stm32_resolve_spi_irq_handler(SPI_HandleTypeDef *hspi)
{
    switch((uintptr_t)hspi->Instance) {
#if SPI_0_ENABLED
    case (uintptr_t)SPI1:
        return (uint32_t)&spi1_irq_handler;
#endif
#if SPI_1_ENABLED
    case (uintptr_t)SPI2:
        return (uint32_t)&spi2_irq_handler;
#endif
#if SPI_2_ENABLED
    case (uintptr_t)SPI3:
        return (uint32_t)&spi3_irq_handler;
#endif
#if SPI_3_ENABLED
    case (uintptr_t)SPI4:
        return (uint32_t)&spi4_irq_handler;
#endif
#if SPI_4_ENABLED
    case (uintptr_t)SPI5:
        return (uint32_t)&spi5_irq_handler;
#endif
#if SPI_5_ENABLED
    case (uintptr_t)SPI6:
        return (uint32_t)&spi6_irq_handler;
#endif
    default:
        assert(0);
    }
}

int
hal_spi_init(int spi_num, void *usercfg, uint8_t spi_type)
{
    struct stm32_hal_spi *spi;
    int rc;

    /* Check for valid arguments */
    rc = -1;
    if (usercfg == NULL) {
        goto err;
    }

    if ((spi_type != HAL_SPI_TYPE_MASTER) && (spi_type != HAL_SPI_TYPE_SLAVE)) {
        goto err;
    }

    /* Allow user to specify default init settings for the SPI.
     * This can be done in BSP, so that only the generic SPI settings
     * are passed to the user configure() call.
     */
    STM32_HAL_SPI_RESOLVE(spi_num, spi);

    spi->cfg = *(struct stm32_hal_spi_cfg *)usercfg;
    spi->slave = (spi_type == HAL_SPI_TYPE_SLAVE);
    switch (spi_num) {
#if SPI_0_ENABLED
    case 0:
        spi->handle.Instance = SPI1;
        break;
#endif
#if SPI_1_ENABLED
    case 1:
        spi->handle.Instance = SPI2;
        break;
#endif
#if SPI_2_ENABLED
    case 2:
        spi->handle.Instance = SPI3;
        break;
#endif
#if SPI_3_ENABLED
    case 3:
        spi->handle.Instance = SPI4;
        break;
#endif
#if SPI_4_ENABLED
    case 4:
        spi->handle.Instance = SPI5;
        break;
#endif
#if SPI_5_ENABLED
    case 5:
        spi->handle.Instance = SPI6;
        break;
#endif
    default:
        rc = -1;
        goto err;
    }

    return (0);
err:
    return (rc);
}

static int
stm32_spi_resolve_prescaler(uint8_t spi_num, uint32_t baudrate, uint32_t *prescaler)
{
    uint32_t candidate_br;
    uint32_t apbfreq;
    int i;

    /* SPIx {1,4,5,6} use PCLK2 on the STM32F4/F7, otherwise use PCKL1.
     * The numbers in the switch below are offset by 1, because the HALs index
     * SPI ports from 0.
     */
    switch (spi_num) {
#if !MYNEWT_VAL(MCU_STM32F0) && !MYNEWT_VAL(MCU_STM32G0)
    case 0:
    case 3:
    case 4:
    case 5:
        apbfreq = HAL_RCC_GetPCLK2Freq();
        break;
#endif
    default:
        apbfreq = HAL_RCC_GetPCLK1Freq();
        break;
    }

    if (baudrate == 0) {
        *prescaler = 0;
        return 0;
    }

    /* Calculate best-fit prescaler: divide the clock by each subsequent
     * prescaler until we reach the highest prescaler that generates at
     * _most_ the baudrate.
     */
    *prescaler = SPI_BAUDRATEPRESCALER_256;
    for (i = 0; i < 8; i++) {
        candidate_br = apbfreq >> (i + 1);
        if (candidate_br <= baudrate) {
#if defined(SPI_CR1_BR_Pos)
            *prescaler = i << SPI_CR1_BR_Pos;
#else
            *prescaler = i << SPI_CFG1_MBR_Pos;
#endif
            break;
        }
    }

    return (0);
}

/**
 * Sets the txrx callback (executed at interrupt context) when the
 * buffer is transferred by the master or the slave using the non-blocking API.
 * Cannot be called when the spi is enabled. This callback will also be called
 * when chip select is de-asserted on the slave.
 *
 * NOTE: This callback is only used for the non-blocking interface and must
 * be called prior to using the non-blocking API.
 *
 * @param spi_num   SPI interface on which to set callback
 * @param txrx      Callback function
 * @param arg       Argument to be passed to callback function
 *
 * @return int 0 on success, non-zero error code on failure.
 */
int
hal_spi_set_txrx_cb(int spi_num, hal_spi_txrx_cb txrx_cb, void *arg)
{
    struct stm32_hal_spi *spi;
    int rc = 0;
    int sr;

